fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммыАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбоненскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ГруппаВидДоговора = Элементы.Добавить("ГруппаФормыВидДоговора", Тип("ГруппаФормы"));
	ГруппаВидДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаВидДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	ГруппаВидДоговора.ОтображатьЗаголовок = Истина;
	ГруппаВидДоговора.Заголовок = "Данные договора:";
	ГруппаВидДоговора.Видимость = Ложь;

	ДатаНачалаДействия = Элементы.Добавить("ДатаНачалаДействия", Тип("ПолеФормы"), ГруппаВидДоговора);
	ДатаНачалаДействия.Вид = ВидПоляФормы.ПолеВвода;
	ДатаНачалаДействия.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействия";

	ДатаОкончанияДействия = Элементы.Добавить("ДатаОкончанияДействия", Тип("ПолеФормы"), ГруппаВидДоговора);
	ДатаОкончанияДействия.Вид = ВидПоляФормы.ПолеВвода;
	ДатаОкончанияДействия.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействия";

	СуммыАбонентскойПлаты = Элементы.Добавить("СуммыАбонентскойПлаты", Тип("ПолеФормы"), ГруппаВидДоговора);
	СуммыАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	СуммыАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммыАбонентскойПлаты";

	СтоимостьЧасаРаботы = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), ГруппаВидДоговора);
	СтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	СтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";

КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)

	Если Объект.ВидДоговора = ПредопределенноеЗначение(
		"Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда
		Элементы.ГруппаФормыВидДоговора.Видимость = Истина;
	Иначе
		Элементы.ГруппаФормыВидДоговора.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры
